Repository: gflohr/esgettext
Catalog: packages/tools/po/*.po
Languages: de

source: Describe process for adding languages.
de: Beschreibe Verfahren zum Hinzufügen von Sprachen.

source: The textdomain of your package
de: Die Textdomain des Paketes

source: Directory where your po files are located
de: Verzeichnis, in dem die PO-Dateien liegen

source: Please execute this command:
de: Bitte dieses Kommando ausführen:

source: ll_CC
de: ll_LL

source: Replace '{placeholder}' with the two-letter language code of the language, optionally followed by an underscore and the two-letter country code.
de: Ersetze „{placeholder}“ mit dem 2-Buchstaben-Code der Sprache, optional gefolgt von einem Unterstrich mit dem 2-Buchstaben-Code des Landes.

source: If you prefer to separate language and country by a hyphen, rename the file later.
de: Wenn man Bindestriche zum Trennen der Sprache und des Landes bevorzugt, kann man die Datei später umbenennen.

source: When you are done, update the list of locales in the configuration file '{filename}'. The variable name is '{varname}'.
de: Nicht vergessen, die Liste der Lokalen in der Konfigurationsdatei „{filename}“ zu erweitern. Der Name der Variablen ist „{varname}“.

source: Warning! The command will open an internet connection to download the plural function and some other data for that language!
de: Warnung! Das Kommando wird eine Internet-Verbindung aufbauen, um die Pluralfunktion und weitere Daten für Sprache herunterzuladen!

source: INPUTFILE
de: EINGABEDATEI

source: OUTPUTFILE
de: AUSGABEDATEI

source: Convert translation catalogs.
de: Konvertiere Übersetzungskataloge.

source: Input file (stdin when omitted)
de: Eingabedatei (Standardeingabe, wenn weggelassen)

source: File locations:
de: Speicherorte der Dateien:

source: Output file (stdout when omitted)
de: Ausgabedatei (Standardausgabe falls weggelassen)

source: Input file format (default: derived from filename)
de: Eingabedateiformat (Vorgabe: Aus dem Dateinamen ermittelt)

source: File formats:
de: Dateiformate:

source: Output file format (default: derived from format)
de: Ausgabedateiformat (Vorgabe: Aus dem Dateinamen ermittelt)

source: Enable verbose output
de: Mehr Hinweise während der Verarbeitung geben

source: Input file (or option -i or standard input)
de: Eingabedatei (oder Option -i oder Standardeingabe)

source: Output file (or option -o or standard output)
de: Ausgabedatei (oder Option -o oder Standardausgabe)

source: Detected input format {inputFormat}.
de: Erkenntes Eingabeformat {inputFormat}.

source: Detected output format {outputFormat}.
de: Erkenntes Ausgabeformat {outputFormat}.

source: {programName}: Error: {e}
de: {programName}: Fehler: {e}

source: {programName}: Error: The option '--inputFormat' is mandatory, when reading from standard input
de: {programName}: Fehler: Die Option „—inputFormat“ ist verpflichtend, wenn von der Standardeingabe gelesen wird

source: {programName}: Error: Please specify the input format with '--inputFormat'! Cannot guess it from input filename '{filename}'!
de: {programName}: Fehler: Bitte das Eingabeformat mit „—inputFormat“ angeben! Es kann icht vom Namen der Eingabedatei „{filename}“ erschlossen werden!

source: Only 'mo.json', 'mo', 'gmo', and 'json' are allowed as input formats!
de: Nur „mo.json“, „mo“, „gmo“ und „json“ sind als Eingabeformat erlaubt!

source: {programName}: Error: The option '--outputFormat' is mandatory, when writing to standard input
de: {programName}: Fehler: Die Option „—outputFormat“ ist verpflichtend, wenn auf die Standardausgabe geschrieben wird

source: {programName}: Error: Please specify the output format with '--outputFormat'! Cannot guess it from input filename '{filename}'!
de: {programName}: Fehler: Bitte das Ausgabeformat mit „—outputFormat“ angeben! Es kann nicht aus dem Dateinamen „{filename}“ erschlossen werden!

source: Only 'mo.json' and 'json' are allowed as output formats!
de: Nur „mo.json“ und „json“ sind als Ausgabeformate erlaubt!

source: [standard input]
de: [Standardeingabe]

source: {filename}: read failed: {error}
de: {filename}: Lesen fehlgeschlagen: {error}

source: {filename}: Error: msgid '{msgid}': plural forms are not supported by the 'json' catalog format!
de: {filename}: Fehler: Meldung „{msgid}“: Pluralformen werden vom Katalogformat „json“ nicht unterstützt!

source: {filename}: write failed: {error}
de: {filename}: Schreiben fehlgeschlagen: {error}

source: Prepare a package to use esgettext.
de: Ein Paket auf die Verwendung von esgettext vorbereiten.

source: Overwrite existing files.
de: Existierende Dateien überschreiben.

source: Just print what would be done without writing anything; implies --verbose.
de: Nur ausgeben, was passieren würde, ohne etwas zu verändern, impliziert „—verbose“.

source: The tool '{tool}' is in your $PATH. No need to save it in the configuration.
de: Das Program „{tool}“ ist im Standardsuchpfad enthalten. Es braucht nicht in der Konfiguration gespeichert zu werden.

source: Setting configuration values.
de: Konfigurationsvariablen setzen.

source: Your input
de: Eingabe

source: Validating the configuration.
de: Validierung der Konfiguration.

source: your input
de: Eingabe

source: Please try again with option --verbose to see the origin of the above errors.
de: Bitte nochmals mit Option „—verbose“ versuchen, um die Quelle des obigen Fehlers zu sehen.

source: Configuration for esgettext, created by {package} {version}.
de: Konfiguration für esgettext, mit {package} {version} erzeugt.

source: Creating PO directory '{directory}'.
de: Erzeuge PO-Verzeichnis „{directory}“.

source: PO directory '{directory}' already exists.
de: PO-Verzeichnis „{directory}“ existiert bereits.

source: Writing configuration to '{filename}'.
de: Schreibe Konfiguration in „{filename}“.

source: Adding package '{package}' version '{version}' as a dependency.
de: Füge Paket „{package}“ Version „{version}“ als Abhängigkeit zu.

source: Adding package '{package}' version {version} as a development dependency.
de: Füge Paket „{package}“ Version „{version}“ als Abhängigkeit zu.

source: Adding package '{package}' version {version} as a development dependencyy.
de: Füge Paket „{package}“ Version „{version}“ als Entwicklungs-Abhängigkeit zu.

source: Writing updated '{filename}'.
de: Schreibe aktualisierte „{filename}“..

source: Run '{command}'.
de: Führe „{command}“ aus.

source: The next steps are:
de: Die nächsten Schritte sind:

source: 1) Mark translatable strings in your code like this "gtx._('Hello, world!')".
de: 1. Übersetzbare Zeichenkette im Code wie „gtx._(’Hello, world!’)“ markieren.

source: 2) Extract strings with '{command}' into '{filename}'.
de: 2. Zeichenketten mit „{command}“ in „{filename}“ extrahieren.

source: 3) Create a translation file with '{command}' (replace 'xy' with a language code like 'de' or 'pt_BR'). Get more information with '{command2}'
de: 3. Eine Übersetzungsdatei mit dem Kommando „{command}“ („xy“ mit einem Sprachcode wie „de“ oder „pt_BR“ ersetzen) erzeugen. Mehr Informationen gibt es mit „{command2}“.

source: 4) Translate the message with a PO editor of your choice.
de: 4. Die Meldungen mit einem PO-Editor übersetzen.

source: 5) Install the translation with '{command}'.
de: 5. Die Übersetzung mit „{command}“ installieren.

source: The command '{command}' executes all steps of the translation workflow at once.
de: Das Kommando „{command}“ führt alle Schritte des Übersetzungsworkflows auf einmal aus.

source: Analyzing source files.
de: Analyziere Quelldateien.

source: This is a git repo. We will only translate files under version control.
de: Das ist ein Git-Repository. Wir übersetzen nur Dateien unter Versionskontrolle.

source: Looks like you have test files under '{directory}'. We will not translate them.
de: Sieht so aus, als gäbe es Testdateien in „{directory}“. Die werden wir nicht übersetzen.

source: Warning! Could not find any source files. Will use the pattern '{pattern}'.
de: Warnung! Konnte keine Quelldateien finden. Deshalb wird das Suchmuster „{pattern}“ verwendet.

source: Command-line options for extracting strings from source files are: {options}
de: Kommandozeilenoptionen zum Extrahieren aus Quelldateien sind: {options}

source: Error: The file '{filename}' already exists!
de: Fehler: Die Datei „{filename}“ existiert bereits!

source: Will not overwrite without option '{option}'.
de: Ohne die Option „{option}“ wird nichts überschrieben.

source: Error: The file '{filename}' already defines a script '{script}'.
de: Fehler: Die Datei „{filename}” definiert bereits ein Skript „{script}“.

source: The command '{command}' did not work. Error: {error}.
de: Kommando „{command}“ fehlgeschlagen. Fehler: {error}

source: Error writing output:
de: Fehler beim Schreibe der Ausgabe:

source: Please enter at least one character!
de: Bitte mindestens ein Zeichen eingeben!

source: A valid textdomain must not contain a slash ('{slash}'), backslash ('{backslash}', or colon ('{colon}').
de: Eine gültige Textdomain darf keinen Schrägstrich („{slash}“), Backslash („{backslash}“) oder Doppelpunkt („{colon}“) enthlaten.

source: An unknown error occurred: {error}!
de: Unbekannter Fehler aufgetreten: {error}!

source: The directory '{directory}' already exists!
de: Das Verzeichnis „{directory}“ existiert bereits!

source: We'll prepare your package for esgettext in a few seconds.
de: Wir bereiten das Paket für esgettext in ein paar Sekunden vor.

source: In doubt, just hit return!
de: Im Zweifelsfall, einfach Return drücken!

source: Textdomain of your package
de: Die Textdomain des Paketes

source: The '{tool}' program to use:
de: Welches ”{tool}”-Programm benutzt werden soll:

source: (Boolean) options to invoke '{tool}' with
de: (Boolesche) Optionen, mit denen ”{tool}” aufgerufen werden soll.

source: Where to store translation files
de: Wo Übersetzungsdateien abgelegt werden sollen

source: Where to store compiled translations
de: Wo kompilierte Übersetzungen abgelegt werden sollen

source: Which package manager should be used
de: Welche Paketverwaltung soll verwendet werden

source: Where do you want to put configuration
de: Wo soll die Konfiguration gespeichert werden

source: OPTIONS
de: OPTIONEN

source: Install translation catalogs.
de: Übersetzungskataloge installiren.

source: List of locale identifiers
de: Liste von Gebietsschema-IDS (Locale-IDs)

source: Input file options:
de: Eingabedatei-Optionen:

source: Where to search message catalog files
de: Wo Nachrichtenkataloge gesucht werden sollen

source: Input file type
de: Eingabedateityp

source: The textdomain to use
de: Die zu verwendende Textdomain

source: Output file options
de: Ausgabedateioptionen

source: Output directory
de: Ausgabeverzeichnis

source: Output file options:
de: Ausgabedatei-Optionen:

source: Output format
de: Ausgabeformat

source: no locales given
de: Keine Gebietsschemata (locales) angegeben

source: only 'mo.json', 'mo', and 'json' are allowed as output formats!
de: Nur ”mo.json”, ”mo” und ”json” sind als Ausgabeformat erlaubt!

source: Installing '{inFile}' as '{outFile}' ...
de: Installiere ”{inFile}” als ”{outFile}” …

source: Compiling '{inFile}' into '{outFile}' ...
de: Kompiliere ”{inFile}” in ”{outFile}” …

source: {outfile}: Write error: {err}
de: {outfile}: Schreibfehler: {err}

source: {inFile}: plural expressions are not allowed for '.json' output!
de: {inFile}: Pluralausdrücke sind für Ausgabe im Format ”.json” nicht erlaubt!

source: Invoke 'msgfmt' for multiple files.
de: Rufe ”msgfmt” für mehrere Dateien auf.

source: Search '.po' files in DIRECTORY
de: Suche ”.po”-Dateien in VERZEICHNIS

source: Output file format
de: Ausgabedateiformat

source: '{program}' program if not in $PATH
de: Programm ”{program}”, falls nicht in $PATH

source: Mode of operation:
de: Art der Verarbeitung:

source: Options to pass to '{program}' program (without leading hyphens)
de: Optionen, die an ”{program}” übergeben werden (ohne führende Bindestriche)

source: {programName}: option '{option}': Options passed to '{program}' must be given without leading hyphens
de: {programName}: Option ’{option}’: Optionen, die an ’{program}’ übergeben werden sollen, müssen ohne führende Bindestriche angegeben werden

source: Compiling '{po}' into '{mo}'.
de: Kompiliere ’{po}’ in ’{mo}’.

source: Failed to run '{prg}': {err}
de: Fehler bei der Ausführung von ”{prg}”: {err}

source: POTFILE
de: POT-DATE

source: Invoke 'msgmerge' for multiple files.
de: Rufe ”msgmerge” für mehrere Dateien auf.

source: Catalog file with up-to-date message ids
de: Katalogdatei mit aktuellen Meldungs-IDs

source: Merging '{pot}' into '{po}'.
de: Führe ”{pot}” mit ”{po}” zusammen.

source: PATTERN
de: MUSTER

source: Write a list of filenames with translatable strings to standard output.
de: Schreibe eine Liste von Dateinamen mit übersetzbaren Zeichenketten auf die Standardausgabe.

source: Pattern for files to ignore.
de: Muster für zu ignorierende Dateien.

source: Only list files under (git) version control.
de: Liste nur Dateien unter (Git-)Versionskontrolle.

source: Pattern for additional files to include (even when not under version control).
de: Muster für weitere einzuschließende Dateien (auch wenn nicht unter Versionskontrolle).

source: Make paths relative to this directory.
de: Mache Pfade relativ zu diesem Verzeichnis.

source: Filename patterns for source files
de: Dateinamensmuster für Eingabedateien

source: {programName}: Error: No filename patterns specified!
de: {programName}: Fehler: Keine Dateinamensmuster angegeben!

source: Extract translatable strings from given input files.
de: Aus den Eingabedateien die zu übersetzenden Meldungen herausschreiben.

source: Input file location:
de: Angaben zu Eingabedateien:

source: get list of input files from FILE
de: Namen der Eingabedateien aus dieser Datei lesen

source: add directory to list for input files search If input file is -, standard input is read.
de: Verzeichnis der Liste der Eingabedateien hinzufügen; wenn die Eingabedatei »-« ist, wird die Standardeingabe gelesen.

source: Output file location:
de: Angaben zu Ausgabedateien:

source: use NAME.po for output (instead of messages.po)
de: benutze NAME.po (statt messages.po) für die Ausgabe

source: write output to specified file
de: schreibe die Ausgabe in die angegebene Datei

source: output files will be placed in the specified directory. If output file is -, output is written to standard output.
de: Ausgabedatei wird in dieses Verzeichnis geschrieben. Falls die Ausgabedatei - ist, wird auf die Standardausgabe geschrieben.

source: Choice of input file language:
de: Wahl der Sprache für die Eingabedatei:

source: recognise the specified language (JavaScript, TypeScript, HTML). Default is to auto-detect language based on filename extension.
de: erkennt die angegebene Programmiersprache (JavaScript, TypeScript, HTML). Voreinstellung ist die Sprache anhand der Dateinamenserweiterung zu erkennen.

source: Interpretation of input files:
de: Interpretation der Eingabedatei:

source: encoding of input files
de: Kodierung der Eingabedateien

source: join messages with existing file
de: Meldungen mit existierender Datei zusammenführen

source: entries from this po file are not extracted
de: Meldungen aus dieser po-Datei werden nicht extrahiert

source: place comment blocks starting with this string and preceding keyword lines in output file
de: Kommentare, die mit dieser Zeichenkette beginnen und welche einer Zeile mit Schlüsselworten vorausgehen in die Ausgabedatei schreiben

source: place all comment blocks preceding keyword lines in output file
de: alle Kommentarblöcke, die einer Zeile mit Schlüsselworten vorausgehen, in die Ausgabedatei schreiben

source: Language specific options:
de: Sprachspezifische Optionen:

source: extract all strings
de: alle Zeichenketten extrahieren

source: look for this word as an additional keyword
de: zusätzliches Schlüsselwort, das gesucht werden soll

source: argument: WORD:ARG:FLAG, additional flag for strings inside the argument number ARG of keyword WORD
de: Argument: WORT:ARG:SCHALTER, zusätzlicher Schalter für Zeichenketten innerhalb des Arguments Nummer ARG des Schlüsselworts WORT

source: only search for method calls of specified instance names
de: nur nach Methodenaufrufen für die angegebenen Instanznamen suchen

source: Output details:
de: Details zur Ausgabe:

source: write PO file even if empty
de: PO-Datei erstellen, auch wenn sie leer ist

source: set output page width
de: Breite der Ausgabe estlegen

source: do not break long message lines, longer than the output page width, into several lines
de: lange Zeilen in Meldungen, die länger als die Breite der Ausgabe sind, nicht auf mehrere Zeilen umbrechen

source: generate sorted output (deprecated)
de: sortierte Ausgabe erstellen (nicht mehr empfohlen)

source: sort output by file location
de: Ausgabe gemäß Vorkommen in Dateien erstellen

source: don't write header with msgid '""' entry
de: „msgid ”””-Eintrag“ im Kopfteil nicht erstellen

source: set copyright holder in output
de: Urheberrechtsinhaber in Ausgabe setzen

source: omit FSF copyright in output for foreign user
de: keine Zeile mit FSF-Copyright in Ausgabe einfügen

source: set package name in output
de: Paketnamen für die Ausgabe setzen

source: set package version in output
de: Paketversion in Ausgabe setzen

source: set report address for msgid bugs
de: Meldeadresse für msgid-Fehler angeben

source: use this string or "" as prefix for msgstr values
de: Diese Zeichenkette oder ”” als Präfix für msgstr nehmen

source: use this string or "" as suffix for msgstr values
de: Diese Zeichenkette oder ”” als Suffix für msgstr nehmen

source: input files
de: Eingabedateien

source: language "{language}" unknown
de: Sprache ”{language}” unbekannt

source: {programName}: Error: {message}
de: {programName}: Fehler: {message}

source: {programName}: Error: '--join-existing' cannot be used, when output is written to stdout
de: {programName}: Fehler: ”—join-existing” kann nicht verwendet werden, wenn auf die Standardausgabe geschrieben wird

source: language for standard input is unknown without option "--language"; will try TypeScript
de: Sprache für die Standardeingabe ist ohne die Option ”—language” nicht ermittelbar; werde TypeScript versuchen

source: file "{filename}" extension "{extname}" is unknown; will try TypeScript instead
de: Datei ”{filename}” Erweiterung ”{extname}” ist unbekannt; werde TypeScript annehmen

source: {programName}: Warning: {msg}
de: {programName}: Warnung: {msg}

source: no input file given
de: keine Eingabedatei angegeben

source: The field '{field}' must not be empty!
de: Das Feld ”{field}” darf nicht leer sein!

source: The field '{field}' must contain a valid email address or URL!
de: Das Feld ”{field}” muss eine gültige E-Mail-Adresse oder eine gültiger URL sein!

source: The field '{field}' must be a string!
de: Das Feld ”{field}” muss eine Zeichenkette sein!

source: The entries in 'po.locales' must be strings!
de: Die Einträge in ”po.locales” müssen Zeichenketten sein!

source: The entries in 'po.locales' must not be empty!
de: Die Einträge in ”po.locales” dürfen nicht leer sein!

source: There is one configuration error:
de: Es gibt einen Konfigurationsfehler:

source: [path not set]
de: [Pfad nicht gesetzt]

source: {programName}: Error: {filename}: {variable}: {message}.
de: {programName}: Fehler: {filename}: {variable}: {message}

source: {programName}: {filename}: error reading configuration: {error}
de: {programName}: {filename}: Fehler beim Lesen der Konfiguration: {error}

source: {programName}: Error: {filename}: Configuration file name must end in '.mjs', '.cjs', '.js', or '.json'!
de: {programName}: Fehler: {filename}: Der Name der Konfigurationsdatei muss auf ”.mjs”, ”.cjs”, ”.js” oder ”.json” enden!

source: Path to configuration file
de: Pfad zur Konfigurationsdatei

source: Path to 'package.json'
de: Pfad zu ”package.json”

source: Try '{programName} --help' for more information!
de: ”{programName} —help” gibt weitere Informationen!

source: Error: No command given.
de: Fehler: Kein Kommando angegeben.

source: Additional defaults read from: {files}.
de: Weitere Vorgabewerte aus diesen Dateien gelesen: {files}

source: Report bugs in the bugtracker at {url}!
de: Melde Fehler im Fehlererfassungssystem auf {url}!

source: {programName}: unhandled exception: {exception}
de: {programName}: Nicht behandelet Ausnahme: {exception}

source: {programName}: Error: The option '{optname}' cannot be specified more than once!
de: {programName}: Fehler: Die Option ”{optname}” darf nicht mehr nur einmal gegeben werden!

source: Non-ASCII character. Please specify the encoding through "--from-code".
de: Zeichen ist nicht ASCII. Bitte eine Kodierung mit ”—from-code” angeben.

source: invalid multibyte sequence
de: Ungültige Multi-Byte-Folge

source: template literals with embedded expressions are not allowed as arguments to gettext functions because they are not constant
de: Vorlagenliterale mit eingebetteten Ausdrücken sind als Argumente für Gettext-Funktionen nicht zulässig, da sie nicht konstant sind

source: {location}: warning: {msg}
de: {location}: Warnung: {msg}

source: {location}: Error: {msg}
de: {location}: Fehler: {msg}

source: unsupported encoding "{encoding}"
de: Nicht unterstützte Kodierung ”{encoding}”

source: inconsistent use of #~
de: Inkonsistente Verwendung von #~

source: the charset "{charset}" is not a portable encoding name.
de: Der Zeichensatz ”{charset}” ist kein portabler Name für eine Zeichenkodierung.

source: message conversion to the users charset might not work.
de: Die Konvertierung in die Zeichenkodierung der Benutzerin oder des Benutzers könnte eventuell nicht funktionieren.

source: missing "msgid" section
de: Fehlender Abschnitt ”msgid”

source: duplicate message definition...
de: doppelte Definition einer Meldung…

source: ...this is the location of the first definition
de: …hier ist die Meldung zum ersten Mal definiert

source: duplicate "{keyword}" section
de: doppelter Abschnitt ”{keyword}”

source: keyword "{keyword}" unknown
de: Schlüsselwort ”{keyword}” unbekannt

source: end-of-line within string
de: Zeilenende innerhalb einer Zeichenkette

source: invalid control sequence
de: Ungültige Abfolgevon Steuerzeichen

source: ignoring empty flag
de: Leerer Schalter wird ignoriert

source: ignoring mal-formed reference "{reference}"
de: Falsch formatierte Referenz ”{reference}” wird ignoriert

source: syntax error
de: Syntaxfehler

source: Section '{section}' must not contain control characters.
de: Der Abschnitt ”{section}” darf keine Steuerzeichen enthalten.

source: Empty msgid. It is reserved by esgettext. Calling 'gettext()' with an empty msgid returns the header entry with meta information, not the empty string. Consider adding a message context, if this is done intentionally.
de: Eine leerer Abschnitt ”msgid” ist esgettext vorbehalten. Ein Aufruf von ”gettext()` mit einer leeren Meldungs-ID liefert keine leere Zeichenkette, sondern den Kopf mit Metainformationen. Falls die Meldungs-ID absichtlich leer ist, kann vielleicht ein Meldungs-Kontext verwendet werden.

source: flag "{flag}" conflicts with previous flag "{negated}"
de: Schalter ”{flag}” steht im Widerspruch zum vorhergehenden Schalter ”{negated}”

source: The conflicting flag "{negated}" may stem from this location:
de: Der verursachende Schalter ”{negated}|” stammt möglicherweise von dieser Stelle:

source: internationalized messages should not contain the '{escape}' escape sequence
de: Internationalisierte Meldungen sollten nicht die Escape-Sequenz ”{escape}” enthalten

source: filenames must not contain space or newlines
de: Dateinamen dürfen keine Leerzeichen oder Zeilenumbrüche enthalten

source: flags must not contain commas or newlines
de: Schalter (flags) dürfen keine Komma oder Zeilenumbrüche enthalten
