Repository: gflohr/esgettext
Catalog: packages/tools/po/*.po
Languages: de

source: [in memory]
de: [im Speicher]

source: {location}: error: {msg}
de: {location}: Fehler: {msg}

source: Multiple meanings for argument #{num} for function "{function}"!
de: Mehrere Bedeutungen für Argument #{num} für Funktion ”{function}”!

source: Multiple context arguments for function "{function}"!
de: Mehrere Kontext-Argumente für Funktion ”{function}”!

source: Multiple total arguments for function "{function}"!
de: Mehrere totale Argumente für Funktion ”{function}”!

source: Too many forms for function "{function}"!
de: Zu viele Formen für Funktion ”{function}”!

source: Multiple extracted comments for function "{function}"!
de: Mehrere extrahierte Kommentare für Funktion ”{function}”!

source: Invalid argument specification "{spec}" for function "{function}"!
de: Ungültige Argument-Spezifikation ”{spec}” für Funktion ”{function}”!
